# Урок 2 / Задание 3 (on check)

month_list = {1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель", 5: "Май", 6: "Июнь", 7: "Июль", 8: "Август", 9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабрь"}
season_dict = {"Зима": [12, 1, 2], "Весна": [3, 4, 5], "Лето": [6, 7, 8], "Осень": [9, 10, 11]}
month_num = int(input("Введите номер месяца (1-12): "))

if 1 <= month_num <= 12:
    for item in season_dict.items():
        if month_num in item[1]:
            print(f"Введён месяц {month_list[month_num]} - это {item[0]}")
